articles/huel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-10 Wed 20:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Making Myself Drink Huel</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lain-Navi" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default.css" />
<link rel="shortcut icon" type="image/jpg" href="./favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content">
<h1 class="title">Making Myself Drink Huel</h1>
<div id="table-of-contents">
<h1>Table of Contents</h1>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb314651">Thoughts on Huel</a>
<ul>
<li><a href="#orge1ae336">Enter Huel</a></li>
<li><a href="#org6109e34">Huel Flavor Notes / Tier List</a>
<ul>
<li><a href="#org3bc7da0">Banana White RTD (5/9/23) 7/10</a></li>
<li><a href="#org61928a1">Chocolate White RTD (5/10/23) 8/10</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb314651" class="outline-1">
<h1 id="orgb314651">Thoughts on Huel</h1>
<div class="outline-text-1" id="text-orgb314651">
<p>
Longtime followers of my writing probably know that I really like <a href="https://planetbanatt.net/articles/energydrink.html">energy drinks</a>. More specifically, I like drinking new energy drinks, even when I have a feeling they are going to taste bad. I feel like everybody got one or two weird things during the COVID-19 lockdown, and my two weird things were energy drinks and <a href="https://planetbanatt.net/articles/dancegames.html">ITG/DDR</a>. 
</p>

<p>
I've been wanting to play ITG in longer sessions without getting as tired, so I decided the time has come for me to try to lose a bit of weight &#x2013; something I have done <a href="https://planetbanatt.net/articles/health.html">in the past</a>. While there are occasional roadblocks, this is generally not so bad for me; I like to exercise, and I'm relatively good at the weird monastic discipline required to stick to caloric restriction. 
</p>

<p>
However, rather than trying to do the same thing I did the last time I seriously tried to lose weight, I figured I would try to do a much funnier version &#x2013; I would lose weight primarily with my newly adopted COVID-19 personality quirks, namely ITG and drinking weird bad tasting beverages.
</p>
</div>

<div id="outline-container-orge1ae336" class="outline-2">
<h2 id="orge1ae336">Enter Huel</h2>
<div class="outline-text-2" id="text-orge1ae336">
<p>
Huel is a meal replacement beverage, similar to Soylent. I didn't do that much research onto why people prefer one over the other, and I'll probably get around to trying different ones later. I have heard these things taste absolutely terrible, which was part of the reason I ended up deciding that this would be the funniest possible way to lose weight. This highlights something I have decided to start calling "Eryk's Law of Bits": if you start doing something challenging, you will have a much better chance of sticking with it if you decide you are doing it to run an extended bit. It seems stupid to do things this way, but I've found that doing things because they are funny is a much more powerful motivator than doing things because they are vaguely "good for you" or "healthy" or "impressive", all of which I've found to be crushingly weak motivators. 
</p>

<p>
To reiterate, I'm doing almost nothing different compared to the last time I attempted to lose weight. I'm not measuring things as carefully (I eat lunch at work and it would be a bit weird for me to bring the food scale to work compared to just eating more broccoli), but ultimately I'm trying to eat fewer calories and move around more (walking, cardio, etc). If you want a post about how this can be simple, even encouraging, and how you, too, can reach your goals, I have <a href="https://planetbanatt.net/articles/health.html">already written this post</a>. If you want to read some notes about me being a weird freak and drinking meal replacement beverages for fun, then welcome to paradise. 
</p>
</div>
</div>

<div id="outline-container-org6109e34" class="outline-2">
<h2 id="org6109e34">Huel Flavor Notes / Tier List</h2>
<div class="outline-text-2" id="text-org6109e34">
<p>
I do not know ahead of time whether any of these will cross the threshold into "reasonable food" territory. If they do, I think it ought to be regarded with a degree of suspicion. I suspect a possible thing which can happen is that I'll drink enough of these to get used to it and brainwash myself into thinking that they're actually worthy replacements for a nice meal, so I think an important additional variable to keep track of is <i>when</i> I drink each individual flavor. 
</p>
</div>

<div id="outline-container-org3bc7da0" class="outline-3">
<h3 id="org3bc7da0">Banana White RTD (5/9/23) 7/10</h3>
<div class="outline-text-3" id="text-org3bc7da0">
<p>
Originally planned to drink these mostly on the weekends, but the box arrived at my apartment and my curiosity got the best of me. Honestly, I've certainly had worse energy drinks. It tastes a little synthetic, kind of like a banana that was made in a lab where they couldn't quite get it right. Taste wise it wasn't so bad, but it wasn't terribly filling for 400 calories.
</p>
</div>
</div>

<div id="outline-container-org61928a1" class="outline-3">
<h3 id="org61928a1">Chocolate White RTD (5/10/23) 8/10</h3>
<div class="outline-text-3" id="text-org61928a1">
<p>
I think this tastes a bit less like "food" compared to banana. It tastes, in my opinion, a bit better than Banana, and the texture is slightly more tolerable in chocolate form. The general lack of sweetness in these beverages I think works well with chocolate, which works fairly well even a bit bitter. Overall better than expected! 
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
<div id="comments">
    <p></p>
    <hr />
       <div id="disqus_thread">
           <script>
(function() {
var d = document, s = d.createElement('script');
s.src = 'https://planetbanatt.disqus.com/embed.js';
s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>
</body>
</html>
